[   
    {
        "date": "AUGUST 2023 - PRESENT",
        "title": "MPL",
        "subtitle": "SDE Intern",
        "website": "https://www.mpl.live/",
        "details": ["• Founding member of the engineering team, played a pivotal role in creating a cutting-edge product from 0 to 1, leading microservice architectural development, fine-tuning language models, and end-to-end backend implementation.",
                    "• Used Node.js and Java to develop a microservices architecture, while using Kafka to transport messages between services asynchronously",
                    "• Implemented WebSocket and gRPC for rapid client and service communication, enhancing overall system efficiency."],
        "techStack": [
            "Java",
            "Nodejs",
            "ChatGPT Fine Tune Models",
            "gRPC",
            "Kafka",
            "MQTT"
        ]
    },
    {
        "date": "JUNE 2023 - AUGUST 2023",
        "title": "Barclays",
        "subtitle": "Summer Intern",
        "website": "https://home.barclays/",
        "details": ["• Initiated requirements definition and led Figma UI/UX design for a user-friendly ”Application 360 View” interface.",
                    "• Implemented the frontend using React and React-Redux for efficient state management and user-specific data delivery",
                    "• Developed Node.js backend, simulating real data for two internal services, leveraging MongoDB for data management."],
        "techStack": [
            "Figma",
            "React",
            "React-Redux",
            "Node.js",
            "SonarQube"
        ]
    },
    {
        "date": "JANUARY 2023 - MAY 2023",
        "title": "Fleek",
        "subtitle": "Backend Developer Intern",
        "website": "https://www.getfleek.app/",
        "details": ["• Implemented a new transaction history feature for the wallet and digital currency, Fleek Coins, showcasing refunds, purchases, cashbacks, and referrals. The feature significantly improved transparency and usability for customers",
        "• Developed and integrated 20 unit tested APIs with new subscription model for streamlined data management.",
        "• Automated data migration with celery task queue, ensuring timely, accurate updates to the newly migrated table."],
        "techStack": [
            "Django",
            "PostgreSQL",
            "Retool"
        ]
    },
    {
        "date": "JUNE 2022 - AUGUST 2022",
        "title": "Pune Institute of Computer Technology",
        "subtitle": "Research Intern",
        "website": "",
        "details": ["• Created a reliable backup system for files to organize unstructured data from several sources.", "• A Version control is maintained while retaining performance and scalability by allowing many users to start the backup and access any prior versions of a file."],
        "techStack": [
            "Python",
            "PostgreSQL"
        ]
    },
    {
        "date": "FEBURARY 2022 - MAY 2022",
        "title": "Bipolar Factory",
        "subtitle": "Full Stack Developer Intern",
        "website": "https://www.bipolarfactory.com/",
        "details": ["• Worked with MQTT standard messaging protocol for IoT and Developed live hardware status sharing web application and mobile application backend.", "• Designed and created the backend of Uttar Pradesh election polling booth mobile application."],
        "techStack": [
            "MERN Stack",
            "MQTT",
            "GCP",
            "WebSockets"
        ]
    },
    {
        "date": "SEPTEMBER 2021 - DECEMBER 2021",
        "title": "KodeIT",
        "subtitle": "Full Stack Developer Intern",
        "website": "",
        "details": ["• Handling backend and frontend development of the websites and applications using MERN Stack."],
        "techStack": [
            "React",
            "NodeJS",
            "MongoDB",
            "System Design"
        ]
    }
  ]